## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 23 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                 RESOURCE                                 |
|----------|--------------------------------------------------------------------------|
| add      | `module.celery_beat_ecs.aws_cloudwatch_log_group.this`                   |
|          | `module.celery_beat_ecs.aws_ecs_service.this`                            |
|          | `module.celery_beat_ecs.aws_ecs_task_definition.this`                    |
|          | `module.celery_beat_ecs.aws_iam_policy.this_task[0]`                     |
|          | `module.celery_beat_ecs.aws_iam_policy.this_task_exec`                   |
|          | `module.celery_beat_ecs.aws_iam_role.this_task`                          |
|          | `module.celery_beat_ecs.aws_iam_role.this_task_exec`                     |
|          | `module.celery_beat_ecs.aws_iam_role_policy_attachment.this_task[0]`     |
|          | `module.celery_beat_ecs.aws_iam_role_policy_attachment.this_task_exec`   |
|          | `module.celery_beat_ecs.aws_service_discovery_service.this[0]`           |
|          | `module.celery_worker_ecs.aws_cloudwatch_log_group.this`                 |
|          | `module.celery_worker_ecs.aws_ecs_service.this`                          |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this`                  |
|          | `module.celery_worker_ecs.aws_iam_policy.this_task[0]`                   |
|          | `module.celery_worker_ecs.aws_iam_policy.this_task_exec`                 |
|          | `module.celery_worker_ecs.aws_iam_role.this_task`                        |
|          | `module.celery_worker_ecs.aws_iam_role.this_task_exec`                   |
|          | `module.celery_worker_ecs.aws_iam_role_policy_attachment.this_task[0]`   |
|          | `module.celery_worker_ecs.aws_iam_role_policy_attachment.this_task_exec` |
|          | `module.celery_worker_ecs.aws_service_discovery_service.this[0]`         |
| update   | `module.superset_ecs.aws_iam_policy.this_task[0]`                        |
| recreate | `module.superset_ecs.aws_ecs_service.this`                               |
|          | `module.superset_ecs.aws_ecs_task_definition.this`                       |
|          | `module.superset_ecs.aws_service_discovery_service.this[0]`              |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-superset/actions/runs/7790718684).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.celery_beat_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
                            ]
                          + Sid      = "GetSSMParameters"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.celery_beat_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.celery_beat_ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/superset"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = "superset"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "celery-beat"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-038e16631d49d3f69",
            ]
          + subnets          = [
              + "subnet-09fbcf711c8abc44c",
              + "subnet-0b910474dd8b7ce8f",
            ]
        }

      + service_registries {
          + container_name = "celery-beat"
          + registry_arn   = (known after apply)
        }
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command                = [
                      + "/app/docker/docker-bootstrap.sh",
                      + "beat",
                    ]
                  + environment            = [
                      + {
                          + name  = "REDIS_HOST"
                          + value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                      + {
                          + name  = "REDIS_PORT"
                          + value = "6379"
                        },
                      + {
                          + name  = "SUPERSET_DATABASE_DB"
                          + value = "superset"
                        },
                    ]
                  + image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  + linuxParameters        = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/superset"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + name                   = "celery-beat"
                  + portMappings           = [
                      + {
                          + containerPort = 8088
                          + hostPort      = 8088
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "SUPERSET_DATABASE_HOST"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      + {
                          + name      = "SUPERSET_DATABASE_USER"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      + {
                          + name      = "SUPERSET_DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      + {
                          + name      = "SUPERSET_SECRET_KEY"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "celery-beat"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.celery_beat_ecs.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "celery-beat_ecs_task_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::066023111852:role/SupersetAthenaRead"
                      + Sid      = "AssumeRoles"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.celery_beat_ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "celery-beat_ecs_task_exec_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.celery_beat_ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "celery-beat_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.celery_beat_ecs.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "celery-beat_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.celery_beat_ecs.aws_iam_role_policy_attachment.this_task[0] will be created
  + resource "aws_iam_role_policy_attachment" "this_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "celery-beat_ecs_task_role"
    }

  # module.celery_beat_ecs.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "celery-beat_ecs_task_exec_role"
    }

  # module.celery_beat_ecs.aws_service_discovery_service.this[0] will be created
  + resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "celery-beat"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = "ns-uugj55nyrkvti54y"
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 5
        }
    }

  # module.celery_worker_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
                              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
                            ]
                          + Sid      = "GetSSMParameters"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.celery_worker_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.celery_worker_ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/superset"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = "superset"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "celery-worker"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-038e16631d49d3f69",
            ]
          + subnets          = [
              + "subnet-09fbcf711c8abc44c",
              + "subnet-0b910474dd8b7ce8f",
            ]
        }

      + service_registries {
          + container_name = "celery-worker"
          + registry_arn   = (known after apply)
        }
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command                = [
                      + "/app/docker/docker-bootstrap.sh",
                      + "worker",
                    ]
                  + environment            = [
                      + {
                          + name  = "REDIS_HOST"
                          + value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                      + {
                          + name  = "REDIS_PORT"
                          + value = "6379"
                        },
                      + {
                          + name  = "SUPERSET_DATABASE_DB"
                          + value = "superset"
                        },
                    ]
                  + image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  + linuxParameters        = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/superset"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + name                   = "celery-worker"
                  + portMappings           = [
                      + {
                          + containerPort = 8088
                          + hostPort      = 8088
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "SUPERSET_DATABASE_HOST"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      + {
                          + name      = "SUPERSET_DATABASE_USER"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      + {
                          + name      = "SUPERSET_DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      + {
                          + name      = "SUPERSET_SECRET_KEY"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "celery-worker"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.celery_worker_ecs.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "celery-worker_ecs_task_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::066023111852:role/SupersetAthenaRead"
                      + Sid      = "AssumeRoles"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.celery_worker_ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "celery-worker_ecs_task_exec_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.celery_worker_ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "celery-worker_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.celery_worker_ecs.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "celery-worker_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.celery_worker_ecs.aws_iam_role_policy_attachment.this_task[0] will be created
  + resource "aws_iam_role_policy_attachment" "this_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "celery-worker_ecs_task_role"
    }

  # module.celery_worker_ecs.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["module.superset-redis.aws_elasticache_subnet_group.default"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
